(function () {
  const substitutions = {
    // Vowels
    अ: "ᱚ",
    आ: "ᱟ",
    इ: "ᱤ",
    ई: "ᱤ", // Could potentially differentiate based on context, but common is just "ᱤ"
    उ: "ᱩ",
    ऊ: "ᱩ", // Same note as above
    ऋ: "ᱨᱤ", // Approximation -  Ol Chiki doesn't have a perfect equivalent
    ए: "ᱮ",
    ऐ: "ᱮᱭ",
    ओ: "ᱳ",
    औ: "ᱚᱣ",

    "ा": "ᱟ",
    "ि": "ᱤ",
    "ी": "ᱤ",
    "ु": "ᱩ",
    "ू": "ᱩ",
    "े": "ᱮ",
    "ै": "ᱮᱭ",
    "ो": "ᱚ",
    "ौ": "ᱚᱣ",

    // Consonants
    // TODO: क - ङ
    क: "ᱠᱚ", // क
    का: "ᱠᱟ",
    कि: "ᱠᱤ",
    की: "ᱠᱤ",
    कु: "ᱠᱩ",
    कू: "ᱠᱩ",
    के: "ᱠᱮ",
    कै: "ᱠᱮᱭ",
    को: "ᱠᱚ",
    कौ: "ᱠᱚᱣ",
    ख: "ᱠᱷᱚ", // ख
    खा: "ᱠᱷᱟ",
    खि: "ᱠᱷᱤ",
    खी: "ᱠᱷᱤ",
    खु: "ᱠᱷᱩ",
    खू: "ᱠᱷᱩ",
    खे: "ᱠᱷᱮ",
    खै: "ᱠᱷᱮᱭ",
    खो: "ᱠᱷᱚ",
    खौ: "ᱠᱷᱚᱣ",
    ग: "ᱜᱚ", // ग
    गा: "ᱜᱟ",
    गि: "ᱜᱤ",
    गी: "ᱜᱤ",
    गु: "ᱜᱩ",
    गू: "ᱜᱩ",
    गे: "ᱜᱮ",
    गै: "ᱜᱮᱭ",
    गो: "ᱜᱚ",
    गौ: "ᱜᱚᱣ",
    घ: "ᱜᱷᱚ", // घ
    घा: "ᱜᱷᱟ",
    घि: "ᱜᱷᱤ",
    घी: "ᱜᱷᱤ",
    घु: "ᱜᱷᱩ",
    घू: "ᱜᱷᱩ",
    घे: "ᱜᱷᱮ",
    घै: "ᱜᱷᱮᱭ",
    घो: "ᱜᱷᱚ",
    घौ: "ᱜᱷᱚᱣ",
    ङ: "ᱝᱚ", // ङ
    ङा: "ᱝᱟ",
    ङि: "ᱝᱤ",
    ङी: "ᱝᱤ",
    ङु: "ᱝᱩ",
    ङू: "ᱝᱩ",
    ङे: "ᱝᱮ",
    ङै: "ᱝᱮᱭ",
    ङो: "ᱝᱚ",
    ङौ: "ᱝᱚᱣ",
    // TODO: च - ञ
    च: "ᱪᱚ", // च
    चा: "ᱪᱟ",
    चि: "ᱪᱤ",
    ची: "ᱪᱤ",
    चु: "ᱪᱩ",
    चू: "ᱪᱩ",
    चे: "ᱪᱮ",
    चै: "ᱪᱮᱭ",
    चो: "ᱪᱚ",
    चौ: "ᱪᱚᱣ",
    छ: "ᱪᱷᱚ", // छ
    छा: "ᱪᱷᱟ",
    छि: "ᱪᱷᱤ",
    छी: "ᱪᱷᱤ",
    छु: "ᱪᱷᱩ",
    छू: "ᱪᱷᱩ",
    छे: "ᱪᱷᱮ",
    छै: "ᱪᱷᱮᱭ",
    छो: "ᱪᱷᱚ",
    छौ: "ᱪᱷᱚᱣ",
    ज: "ᱡᱚ", // ज
    जा: "ᱡᱟ",
    जि: "ᱡᱤ",
    जी: "ᱡᱤ",
    जु: "ᱡᱩ",
    जू: "ᱡᱩ",
    जे: "ᱡᱮ",
    जै: "ᱡᱮᱭ",
    जो: "ᱡᱚ",
    जौ: "ᱡᱚᱣ",
    झ: "ᱡᱷᱚ", // झ
    झा: "ᱡᱷᱟ",
    झि: "ᱡᱷᱤ",
    झी: "ᱡᱷᱤ",
    झु: "ᱡᱷᱩ",
    झू: "ᱡᱷᱩ",
    झेे: "ᱡᱷᱮ",
    झै: "ᱡᱷᱮᱭ",
    झो: "ᱡᱷᱚ",
    झौ: "ᱡᱷᱚᱣ",
    ञ: "ᱧᱚ", // ञ
    ञा: "ᱧᱟ",
    ञि: "ᱧᱤ",
    ञी: "ᱧᱤ",
    ञु: "ᱧᱩ",
    ञू: "ᱧᱩ",
    ञे: "ᱧᱮ",
    ञै: "ᱧᱮᱭ",
    ञो: "ᱧᱚ",
    ञौ: "ᱧᱚᱣ",
    // TODO: ट - ण
    ट: "ᱴᱚ", // ट
    टा: "ᱴᱟ",
    टि: "ᱴᱤ",
    टी: "ᱴᱤ",
    टु: "ᱴᱩ",
    टू: "ᱴᱩ",
    टे: "ᱴᱮ",
    टै: "ᱴᱮᱭ",
    टो: "ᱴᱚ",
    टौ: "ᱴᱚᱣ",
    ठ: "ᱴᱷᱚ", // ठ
    ठा: "ᱴᱷᱟ",
    ठि: "ᱴᱷᱤ",
    ठी: "ᱴᱷᱤ",
    ठु: "ᱴᱷᱩ",
    ठू: "ᱴᱷᱩ",
    ठे: "ᱴᱷᱮ",
    ठै: "ᱴᱷᱮᱭ",
    ठो: "ᱴᱷᱚ",
    ठौ: "ᱴᱷᱚᱣ",
    ड: "ᱰᱚ", // ड
    डा: "ᱰᱟ",
    डि: "ᱰᱤ",
    डी: "ᱰᱤ",
    डु: "ᱰᱩ",
    डू: "ᱰᱩ",
    डे: "ᱰᱮ",
    डै: "ᱰᱮᱭ",
    डो: "ᱰᱚ",
    डौ: "ᱰᱚᱣ",
    ड़: "ᱲᱚ", // ड़
    ड़ा: "ᱲᱟ",
    ड़ि: "ᱲᱤ",
    ड़ी: "ᱲᱤ",
    ड़ु: "ᱲᱩ",
    ड़ू: "ᱲᱩ",
    ड़े: "ᱲᱮ",
    ड़ै: "ᱲᱮᱭ",
    ड़ो: "ᱲᱚ",
    ड़ौ: "ᱲᱚᱣ",
    ढ: "ᱰᱷᱚ", // ढ
    ढा: "ᱰᱷᱟ",
    ढि: "ᱰᱷᱤ",
    ढी: "ᱰᱷᱤ",
    ढु: "ᱰᱷᱩ",
    ढू: "ᱰᱷᱩ",
    ढेे: "ᱰᱷᱮ",
    ढै: "ᱰᱷᱮᱭ",
    ढो: "ᱰᱷᱚ",
    ढौ: "ᱰᱷᱚᱣ",
    ण: "ᱬᱚ", // ण
    णा: "ᱬᱟ",
    णि: "ᱬᱤ",
    णी: "ᱬᱤ",
    णु: "ᱬᱩ",
    णू: "ᱬᱩ",
    णे: "ᱬᱮ",
    णै: "ᱬᱮᱭ",
    णो: "ᱬᱚ",
    णौ: "ᱬᱚᱣ",
    // TODO: त - न
    त: "ᱛᱚ", // त
    ता: "ᱛᱟ",
    ति: "ᱛᱤ",
    ती: "ᱛᱤ",
    तु: "ᱛᱩ",
    तू: "ᱛᱩ",
    ते: "ᱛᱮ",
    तै: "ᱛᱮᱭ",
    तो: "ᱛᱚ",
    तौ: "ᱛᱚᱣ",
    थ: "ᱛᱷᱚ", // थ
    था: "ᱛᱷᱟ",
    थि: "ᱛᱷᱤ",
    थी: "ᱛᱷᱤ",
    थु: "ᱛᱷᱩ",
    थू: "ᱛᱷᱩ",
    थे: "ᱛᱷᱮ",
    थै: "ᱛᱷᱮᱭ",
    थो: "ᱛᱷᱚ",
    थौ: "ᱛᱷᱚᱣ",
    द: "ᱫᱚ", // द
    दा: "ᱫᱟ",
    दि: "ᱫᱤ",
    दी: "ᱫᱤ",
    दु: "ᱫᱩ",
    दू: "ᱫᱩ",
    दे: "ᱫᱮ",
    दै: "ᱫᱮᱭ",
    दो: "ᱫᱚ",
    दौ: "ᱫᱚᱣ",
    ध: "ᱫᱷᱚ", // ध
    धा: "ᱫᱷᱟ",
    धि: "ᱫᱷᱤ",
    धी: "ᱫᱷᱤ",
    धु: "ᱫᱷᱩ",
    धू: "ᱫᱷᱩ",
    धेे: "ᱫᱷᱮ",
    धै: "ᱫᱷᱮᱭ",
    धो: "ᱫᱷᱚ",
    धौ: "ᱫᱷᱚᱣ",
    न: "ᱱᱚ", // न
    ना: "ᱱᱟ",
    नि: "ᱱᱤ",
    नी: "ᱱᱤ",
    नु: "ᱱᱩ",
    नू: "ᱱᱩ",
    ने: "ᱱᱮ",
    नै: "ᱱᱮᱭ",
    नो: "ᱱᱚ",
    नौ: "ᱱᱚᱣ",
    // TODO: प - म
    प: "ᱯᱚ", // प
    पा: "ᱯᱟ",
    पि: "ᱯᱤ",
    पी: "ᱯᱤ",
    पु: "ᱯᱩ",
    पू: "ᱯᱩ",
    पे: "ᱯᱮ",
    पै: "ᱯᱮᱭ",
    पो: "ᱯᱚ",
    पौ: "ᱯᱚᱣ",
    फ: "ᱯᱷᱚ", // फ
    फा: "ᱯᱷᱟ",
    फि: "ᱯᱷᱤ",
    फी: "ᱯᱷᱤ",
    फु: "ᱯᱷᱩ",
    फू: "ᱯᱷᱩ",
    फे: "ᱯᱷᱮ",
    फै: "ᱯᱷᱮᱭ",
    फो: "ᱯᱷᱚ",
    फौ: "ᱯᱷᱚᱣ",
    ब: "ᱵᱚ", // ब
    बा: "ᱵᱟ",
    बि: "ᱵᱤ",
    बी: "ᱵᱤ",
    बु: "ᱵᱩ",
    बू: "ᱵᱩ",
    बे: "ᱵᱮ",
    बै: "ᱵᱮᱭ",
    बो: "ᱵᱚ",
    बौ: "ᱵᱚᱣ",
    भ: "ᱵᱷᱚ", // भ
    भा: "ᱵᱷᱟ",
    भि: "ᱵᱷᱤ",
    भी: "ᱵᱷᱤ",
    भु: "ᱵᱷᱩ",
    भू: "ᱵᱷᱩ",
    भेे: "ᱵᱷᱮ",
    भै: "ᱵᱷᱮᱭ",
    भो: "ᱵᱷᱚ",
    भौ: "ᱵᱷᱚᱣ",
    म: "ᱢᱚ", // म
    मा: "ᱢᱟ",
    मि: "ᱢᱤ",
    मी: "ᱢᱤ",
    मु: "ᱢᱩ",
    मू: "ᱢᱩ",
    मे: "ᱢᱮ",
    मै: "ᱢᱮᱭ",
    मो: "ᱢᱚ",
    मौ: "ᱢᱚᱣ",
    // TODO: य - ह
    य: "ᱭᱚ", // य
    या: "ᱭᱟ",
    यि: "ᱭᱤ",
    यी: "ᱭᱤ",
    यु: "ᱭᱩ",
    यू: "ᱭᱩ",
    ये: "ᱭᱮ",
    यै: "ᱭᱮᱭ",
    यो: "ᱭᱚ",
    यौ: "ᱭᱚᱣ",
    य़: "ᱭᱚ", // य़
    य़ा: "ᱭᱟ",
    य़ि: "ᱭᱤ",
    य़ी: "ᱭᱤ",
    य़ु: "ᱭᱩ",
    य़ू: "ᱭᱩ",
    य़े: "ᱭᱮ",
    य़ै: "ᱭᱮᱭ",
    य़ो: "ᱭᱚ",
    य़ौ: "ᱭᱚᱣ",
    र: "ᱨᱚ", // र
    रा: "ᱨᱟ",
    रि: "ᱨᱤ",
    री: "ᱨᱤ",
    रु: "ᱨᱩ",
    रू: "ᱨᱩ",
    रे: "ᱨᱮ",
    रै: "ᱨᱮᱭ",
    रो: "ᱨᱚ",
    रौ: "ᱨᱚᱣ",
    ळ: "ᱲᱚ", // ळ
    ळा: "ᱲᱟ",
    ळि: "ᱲᱤ",
    ळी: "ᱲᱤ",
    ळु: "ᱲᱩ",
    ळू: "ᱲᱩ",
    ळे: "ᱲᱮ",
    ळै: "ᱲᱮᱭ",
    ळो: "ᱲᱚ",
    ळौ: "ᱲᱚᱣ",
    ल: "ᱞᱚ", // ल
    ला: "ᱞᱟ",
    लि: "ᱞᱤ",
    ली: "ᱞᱤ",
    लु: "ᱞᱩ",
    लू: "ᱞᱩ",
    ले: "ᱞᱮ",
    लै: "ᱞᱮᱭ",
    लो: "ᱞᱚ",
    लौ: "ᱞᱚᱣ",
    व: "ᱣᱚ", // व
    वा: "ᱣᱟ",
    वि: "ᱣᱤ",
    वी: "ᱣᱤ",
    वु: "ᱣᱩ",
    वू: "ᱣᱩ",
    वेे: "ᱣᱮ",
    वै: "ᱣᱮᱭ",
    वो: "ᱣᱚ",
    वौ: "ᱣᱚᱣ",
    श: "ᱥᱚ", // श
    शा: "ᱥᱟ",
    शि: "ᱥᱤ",
    शी: "ᱥᱤ",
    शु: "ᱥᱩ",
    शू: "ᱥᱩ",
    शेे: "ᱥᱮ",
    शै: "ᱥᱮᱭ",
    शो: "ᱥᱚ",
    शौ: "ᱥᱚᱣ",
    ष: "ᱥᱚ", // ष
    षा: "ᱥᱟ",
    षि: "ᱥᱤ",
    षी: "ᱥᱤ",
    षु: "ᱥᱩ",
    षू: "ᱥᱩ",
    षेे: "ᱥᱮ",
    षै: "ᱥᱮᱭ",
    षो: "ᱥᱚ",
    षौ: "ᱥᱚᱣ",
    स: "ᱥᱚ", // स
    सा: "ᱥᱟ",
    सि: "ᱥᱤ",
    सी: "ᱥᱤ",
    सु: "ᱥᱩ",
    सू: "ᱥᱩ",
    सेे: "ᱥᱮ",
    सै: "ᱥᱮᱭ",
    सो: "ᱥᱚ",
    सौ: "ᱥᱚᱣ",
    ह: "ᱦᱚ", // ह
    हा: "ᱦᱟ",
    हि: "ᱦᱤ",
    ही: "ᱦᱤ",
    हु: "ᱦᱩ",
    हू: "ᱦᱩ",
    हे: "ᱦᱮ",
    है: "ᱦᱮᱭ",
    हो: "ᱦᱚ",
    हौ: "ᱦᱚᱣ",
    // TODO: क्ष - ऋ
    क्ष: "ᱠᱷᱭᱚ", // क्ष
    क्षा: "ᱠᱷᱭᱟ",
    क्षि: "ᱠᱷᱭᱤ",
    क्षी: "ᱠᱷᱭᱤ",
    क्षु: "ᱠᱷᱭᱩ",
    क्षू: "ᱠᱷᱭᱩ",
    क्षेे: "ᱠᱷᱭᱮ",
    क्षै: "ᱠᱷᱭᱮᱭ",
    क्षो: "ᱠᱷᱭᱚ",
    क्षौ: "ᱠᱷᱭᱚᱣ",
    त्र: "ᱛᱨᱚ", // त्र
    त्रा: "ᱛᱨᱟ",
    त्रि: "ᱛᱨᱤ",
    त्री: "ᱛᱨᱤ",
    त्रु: "ᱛᱨᱩ",
    त्रू: "ᱛᱨᱩ",
    त्रेे: "ᱛᱨᱮ",
    त्रै: "ᱛᱨᱮᱭ",
    त्रो: "ᱛᱨᱚ",
    त्रौ: "ᱛᱨᱚᱣ",
    श्र: "ᱥᱨᱚ", // श्र
    श्रा: "ᱥᱨᱟ",
    श्रि: "ᱥᱨᱤ",
    श्री: "ᱥᱨᱤ",
    श्रु: "ᱥᱨᱩ",
    श्रू: "ᱥᱨᱩ",
    श्रेे: "ᱥᱨᱮ",
    श्रै: "ᱥᱨᱮᱭ",
    श्रो: "ᱥᱨᱚ",
    श्रौ: "ᱥᱨᱚᱣ",
    ज्ञ: "ᱜᱽᱭᱚᱸ", // ज्ञ
    ज्ञा: "ᱜᱽᱭᱟᱸ",
    ज्ञि: "ᱜᱽᱭᱤᱸ",
    ज्ञी: "ᱜᱽᱭᱤᱸ",
    ज्ञु: "ᱜᱽᱭᱩᱸ",
    ज्ञू: "ᱜᱽᱭᱩᱸ",
    ज्ञेे: "ᱜᱽᱭᱮᱸ",
    ज्ञै: "ᱜᱽᱭᱮᱸᱭ",
    ज्ञो: "ᱜᱽᱭᱚᱸ",
    ज्ञौ: "ᱜᱽᱭᱚᱸᱭ",
    ऋ: "ᱛᱨᱚ", // ऋ
    ऋा: "ᱛᱨᱟ",
    ऋि: "ᱛᱨᱤ",
    ऋी: "ᱛᱨᱤ",
    ऋु: "ᱛᱨᱩ",
    ऋू: "ᱛᱨᱩ",
    ऋेे: "ᱛᱨᱮ",
    ऋै: "ᱛᱨᱮᱭ",
    ऋो: "ᱛᱨᱚ",
    ऋौ: "ᱛᱨᱚᱣ",

    // Exceptions
    क्: "ᱜ",
    ग्: "ᱜ",
    च्: "ᱡ",
    ज्: "ᱡ",
    त्: "ᱫ",
    द्: "ᱫ",
    प्: "ᱵ",
    ब्: "ᱵ",

    // May be used like this
    // ":": "ᱜ",
    ": आ": "ᱜᱼᱟ",
    मितट: "ᱢᱤᱫᱴ",
    //स्क: "ᱥᱠ",
    // Special Characters and numbers
    "ँ": "ᱸ",
    "ं": "ᱸ",
    "ः": "ᱺ",
    "़": "ᱹ", // nukta
    "०": "᱐",
    "१": "᱑",
    "२": "᱒",
    "३": "᱓",
    "४": "᱔",
    "५": "᱕",
    "६": "᱖",
    "७": "᱗",
    "८": "᱘",
    "९": "᱙",

    // Punctuations
    "।": " ᱾",
    "॥": " ᱿",
    ",": ", ",
  };

  const remove_sub_char = ["ᱚ", "ᱟ", "ᱤ", "ᱩ", "ᱮ", "ᱳ"];

  function transliterate(inputText) {
    let outputText = inputText;

    const sortedKeys = Object.keys(substitutions).sort(
      (a, b) => b.length - a.length
    );
    for (const key of sortedKeys) {
      const regex = new RegExp(key, "g");
      outputText = outputText.replace(regex, substitutions[key]);
    }

    // Remove ᱽ before specific characters
    for (const char of remove_sub_char) {
      outputText = outputText.replace(new RegExp(`ᱽ${char}`, "g"), char);
    }

    return outputText;
  }

  window.performTransliteration = function () {
    const input = document.getElementById("input").value;
    const outputText = transliterate(input);
    document.getElementById("output").textContent = outputText;
  };

  window.copyToClipboard = function () {
    const output = document.getElementById("output").textContent;
    navigator.clipboard
      .writeText(output)
      .then(() => alert("ᱚᱨᱡᱚ ᱨᱮᱴᱟᱵ ᱵᱚᱰᱨᱮ ᱦᱟᱞᱟᱝᱮᱱᱟ!"))
      .catch((err) => console.error("ᱦᱟᱞᱟᱝ ᱦᱩᱲᱟᱹᱜᱼᱮᱱᱟ: ", err));
  };

  window.resetInput = function () {
    document.getElementById("input").value = "";
    document.getElementById("output").textContent =
      "ᱟᱢᱟᱜ ᱪᱤᱠᱤ ᱵᱚᱱᱚᱫᱚᱞᱚᱜ ᱚᱱᱚᱞ ᱠᱚ ᱱᱚᱸᱰᱮᱭ ᱩᱫᱩᱜᱟ...";
  };
})();
