    // Vowels
    अ: "ᱚ",
    आ: "ᱟ",
    इ: "ᱤ",
    ई: "ᱤ", // Could potentially differentiate based on context, but common is just "ᱤ"
    उ: "ᱩ",
    ऊ: "ᱩ", // Same note as above
    ऋ: "ᱨᱤ", // Approximation -  Ol Chiki doesn't have a perfect equivalent
    ए: "ᱮ",
    ऐ: "ᱮᱭ",
    ओ: "ᱳ",
    औ: "ᱚᱣ",

    "ा": "ᱟ",
    "ि": "ᱤ",
    "ी": "ᱤ",
    "ु": "ᱩ",
    "ू": "ᱩ",
    "े": "ᱮ",
    "ै": "ᱮᱭ",
    "ो": "ᱚ",
    "ौ": "ᱚᱣ",

    // Consonants
    // TODO: क - ङ
    क: "ᱠ", // क
    ख: "ᱠᱷ", // ख
    ग: "ᱜ", // ग
    घ: "ᱜᱷ", // घ
    ङ: "ᱝ", // ङ
    // TODO: च - ञ
    च: "ᱪ", // च
    छ: "ᱪᱷ", // छ
    ज: "ᱡ", // ज
    झ: "ᱡᱷ", // झ
    ञ: "ᱧ", // ञ
    // TODO: ट - ण
    ट: "ᱴ", // ट
    ठ: "ᱴᱷ", // ठ
    ड: "ᱰ", // ड
    ड़: "ᱲ", // ड़
    ढ: "ᱰᱷ", // ढ
    ण: "ᱬ", // ण
    // TODO: त - न
    त: "ᱛ", // त
    थ: "ᱛᱷ", // थ
    द: "ᱫ", // द
    ध: "ᱫᱷ", // ध
    न: "ᱱ", // न
    // TODO: प - म
    प: "ᱯ", // प
    फ: "ᱯᱷ", // फ
    ब: "ᱵ", // ब
    भ: "ᱵᱷ", // भ
    म: "ᱢ", // म
    // TODO: य - ह
    य: "ᱭ", // य
    य़: "ᱭ", // य़
    र: "ᱨ", // र
    ळ: "ᱲ", // ळ
    ल: "ᱞ", // ल
    व: "ᱣ", // व
    श: "ᱥ", // श
    ष: "ᱥ", // ष
    स: "ᱥ", // स
    ह: "ᱦ", // ह
    // TODO: क्ष - ऋ
    क्ष: "ᱠᱷᱭ", // क्ष
    त्र: "ᱛᱨ", // त्र
    श्र: "ᱥᱨ", // श्र
    ज्ञ: "ᱜᱽᱭ", // ज्ञ
    ऋ: "ᱛᱨᱠᱷ", // ऋ

    // Exceptions
    क्: "ᱜ",
    ग्: "ᱜ",
    च्: "ᱡ",
    ज्: "ᱡ",
    त्: "ᱫ",
    द्: "ᱫ",
    प्: "ᱵ",
    ब्: "ᱵ",

    // May be used like this
    // ":": "ᱜ",
    ": आ": "ᱜᱼᱟ",
    मितट: "ᱢᱤᱫᱴ",
    //स्क: "ᱥᱠ",
    // Special Characters and numbers
    "ँ": "ᱸ",
    "ं": "ᱸ",
    "ः": "ᱺ",
    "़": "ᱹ", // nukta
    "०": "᱐",
    "१": "᱑",
    "२": "᱒",
    "३": "᱓",
    "४": "᱔",
    "५": "᱕",
    "᱖": "᱖",
    "᱗": "᱗",
    "᱘": "᱘",
    "᱙": "᱙",

    // Punctuations
    "।": " ᱾",
    "॥": " ᱿",